nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [64, 64, 1]],

    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, Bottleneck1CBAM_wfinception_CBAM, [128, 128, 2]],

    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, Bottleneck1CBAM_wfinception_CBAM, [256, 256, 3]],

    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [512, 512, 1]],
    # [-1, 3, SE_Block, [512,3]], # danh dau ==
    # [-1, 3, CBAM, [512,512,3]], # danh dau ==
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, 512]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, 256]], # 17 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 18

    [-1, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [256, 256]], # 21 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 22

    [-1, 1, Conv, [512, 3, 2]], #23
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [512, 512]], # 25 (P5/32-large)
    [-1, 3, CBAM, [256, 256,3]], # 26

    [[18, 22, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) de y them
  ]

# 100 epochs completed in 1.885 hours.
# Optimizer stripped from runs/train/exp73/weights/last.pt, 19.1MB
# Optimizer stripped from runs/train/exp73/weights/best.pt, 19.1MB

# Validating runs/train/exp73/weights/best.pt...
# Fusing layers... 
# Bottleneck1CBAM_wfinception_CBAM summary: 371 layers, 9286488 parameters, 0 gradients, 25.3 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:08<00:00,  3.18it/s]
#                    all        874        920      0.836      0.784      0.837      0.515
# Results saved to runs/train/exp73
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/fd849f05a9394eea8d1fdb35a1d64ec0
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4557674527168274, 2.163774013519287)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0016070869429304542, 0.8416077193765956)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.000512600163379636, 0.5153121810346912)
# COMET INFO:     metrics/precision [200]    : (0.0010755148741418764, 0.8594550650998243)
# COMET INFO:     metrics/recall [200]       : (0.0641304347826087, 0.7956521739130434)
# COMET INFO:     train/box_loss [200]       : (0.031375546008348465, 0.0992831289768219)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006841015070676804, 0.019045881927013397)
# COMET INFO:     val/box_loss [200]         : (0.039070434868335724, 0.11246120929718018)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004369209986180067, 0.009573732502758503)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# second time

# 100 epochs completed in 1.884 hours.
# Optimizer stripped from runs/train/exp74/weights/last.pt, 19.1MB
# Optimizer stripped from runs/train/exp74/weights/best.pt, 19.1MB

# Validating runs/train/exp74/weights/best.pt...
# Fusing layers... 
# Bottleneck1CBAM_wfinception_CBAM summary: 371 layers, 9286488 parameters, 0 gradients, 25.3 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:08<00:00,  3.25it/s]
#                    all        874        920      0.864      0.789      0.842      0.522
# Results saved to runs/train/exp74
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/4b209b49642d49c6a1e8690269b0f410
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4225146770477295, 2.163774013519287)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.01396234966952631, 0.8530582226774999)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.003736705251123674, 0.5217149566118484)
# COMET INFO:     metrics/precision [200]    : (0.0010526315789473684, 0.8679557222495076)
# COMET INFO:     metrics/recall [200]       : (0.05543478260869565, 0.7980469600034817)
# COMET INFO:     train/box_loss [200]       : (0.0313514806330204, 0.09947243332862854)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006885724142193794, 0.019021203741431236)
# COMET INFO:     val/box_loss [200]         : (0.038845039904117584, 0.1119050607085228)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.0042859530076384544, 0.008872129954397678)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# third time

# 100 epochs completed in 1.887 hours.
# Optimizer stripped from runs/train/exp75/weights/last.pt, 19.1MB
# Optimizer stripped from runs/train/exp75/weights/best.pt, 19.1MB

# Validating runs/train/exp75/weights/best.pt...
# Fusing layers... 
# Bottleneck1CBAM_wfinception_CBAM summary: 371 layers, 9286488 parameters, 0 gradients, 25.3 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:08<00:00,  3.25it/s]
#                    all        874        920      0.853      0.787      0.844      0.513
# Results saved to runs/train/exp75
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/c761c89b9904408d9b484b671869077e
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.41930514574050903, 2.163774013519287)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.006107973421312355, 0.8479695206942088)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0018301289892003647, 0.5123075157258238)
# COMET INFO:     metrics/precision [200]    : (0.0010678871090770404, 0.8561358583511823)
# COMET INFO:     metrics/recall [200]       : (0.020652173913043477, 0.8137528833181007)
# COMET INFO:     train/box_loss [200]       : (0.03142326697707176, 0.09950978308916092)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006890521384775639, 0.019010335206985474)
# COMET INFO:     val/box_loss [200]         : (0.039222490042448044, 0.11741896718740463)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004323069471865892, 0.009971226565539837)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:
# COMET INFO:     Name                        : exp
# COMET INFO:     Run Path                    : long0307/yolov5/c761c89b9904408d9b484b671869077e
# COMET INFO:     comet_log_batch_metrics     : False
# COMET INFO:     comet_log_confusion_matrix  : True
# COMET INFO:     comet_log_per_class_metrics : False
# COMET INFO:     comet_max_image_uploads     : 100
# COMET INFO:     comet_mode                  : online
# COMET INFO:     comet_model_name            : yolov5
# COMET INFO:     hasNestedParams             : True
# COMET INFO:   Parameters:
