nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [2.9434,4.0435, 3.8626,8.5592, 6.8534, 5.9391]
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 3, CBAM, [512, 512]],
   [-1, 1, SPPF, [2048, 5]],  # 10
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Involution, [1024, 1, 1, 1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [256, False]], # 23 160*160  p2 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 26  80*80 p3 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],
   [-1, 3, C3, [256, False]], # 29 40*40 p4 head

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],  # 32 20*20 p5 head

   [[23, 26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]

# 100 epochs completed in 1.851 hours.
# Optimizer stripped from runs/train/exp105/weights/last.pt, 23.3MB
# Optimizer stripped from runs/train/exp105/weights/best.pt, 23.3MB

# Validating runs/train/exp105/weights/best.pt...
# Fusing layers... 
# cbam-involution summary: 213 layers, 11050075 parameters, 0 gradients, 31.4 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:08<00:00,  3.32it/s]
#                    all        874        920      0.801      0.737      0.775      0.416
# Results saved to runs/train/exp105
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/1d7a7199235c4bdfa2dd54a581ec3336
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.383099228143692, 1.913087248802185)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.00017723095603189016, 0.78667236919027)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (5.297431940601452e-05, 0.41632574613054335)
# COMET INFO:     metrics/precision [200]    : (0.00030511060259344014, 0.8282089537325567)
# COMET INFO:     metrics/recall [200]       : (0.08695652173913043, 0.7815217391304348)
# COMET INFO:     train/box_loss [200]       : (0.03921603411436081, 0.10488030314445496)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.001932797022163868, 0.005162110552191734)
# COMET INFO:     val/box_loss [200]         : (0.038310762494802475, 0.09304895251989365)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.0009571798145771027, 0.0023721472825855017)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others: