nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, GhostBottleneck, [64, 3, 2]], # 0-P1/2
    # [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, GhostBottleneck, [128, 3, 2]], # 1-P2/4
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [64, 64, 1]],

    [-1, 1, GhostBottleneck, [256, 3, 2]], # 3-P3/8
    [-1, 6, Bottleneck1CBAM_wfinception_CBAM, [128, 128, 2]],

    [-1, 1, GhostBottleneck, [512, 3, 2]], # 5-P4/16
    [-1, 9, Bottleneck1CBAM_wfinception_CBAM, [256, 256, 3]],

    [-1, 1, GhostBottleneck, [1024, 3, 2]], # 7-P5/32
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [512, 512, 1]],
    # [-1, 3, SE_Block, [512,3]], # danh dau ==
    # [-1, 3, CBAM, [512,512,3]], # danh dau ==
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, 512]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, 256]], # 17 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 18

    [-1, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [256, 256]], # 21 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 22

    [-1, 1, Conv, [512, 3, 2]], #23
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [512, 512]], # 25 (P5/32-large)
    [-1, 3, CBAM, [256, 256,3]], # 26

    [[18, 22, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) de y them
  ]


# 100 epochs completed in 1.403 hours.
# Optimizer stripped from runs/train/exp107/weights/last.pt, 13.9MB
# Optimizer stripped from runs/train/exp107/weights/best.pt, 13.9MB

# Validating runs/train/exp107/weights/best.pt...
# Fusing layers... 
# thu summary: 259 layers, 6742223 parameters, 0 gradients, 17.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.81it/s]
#                    all        874        920      0.837      0.805      0.844      0.503
# Results saved to runs/train/exp107
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/50741e0d2c8e4b5cb9b239aac2c809e9
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4538976848125458, 2.224395275115967)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0030853735094018685, 0.8456566299152619)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.001068297526046718, 0.5032811353547186)
# COMET INFO:     metrics/precision [200]    : (0.0011937452326468345, 0.8512591731725784)
# COMET INFO:     metrics/recall [200]       : (0.07934782608695652, 0.8211275768522145)
# COMET INFO:     train/box_loss [200]       : (0.03248757869005203, 0.09863739460706711)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007156452629715204, 0.019326062873005867)
# COMET INFO:     val/box_loss [200]         : (0.03968854993581772, 0.09661366045475006)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004300947766751051, 0.00909624807536602)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# Results saved to runs/train/exp136
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/52036946bb2e482dae82f29672a8bec1
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4583429992198944, 2.203545570373535)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.001398722181214817, 0.8411935972907484)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0004487564750353311, 0.5124238031515116)
# COMET INFO:     metrics/precision [200]    : (0.0010297482837528604, 0.870064037934074)
# COMET INFO:     metrics/recall [200]       : (0.05652173913043478, 0.8032608695652174)
# COMET INFO:     train/box_loss [200]       : (0.031998634338378906, 0.09924326837062836)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007005995139479637, 0.01882435753941536)
# COMET INFO:     val/box_loss [200]         : (0.03910098597407341, 0.09803574532270432)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004299994092434645, 0.00945611484348774)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# nc: 1 # number of classes
# depth_multiple: 0.33 # model depth multiple
# width_multiple: 0.50 # layer channel multiple
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32

# backbone:
#   # [from, number, module, args]
#   [
#     [-1, 1, GhostBottleneck, [64, 3, 2]], # 0-P1/2
#     # [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
#     [-1, 1, GhostBottleneck, [128, 3, 2]], # 1-P2/4
#     [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [64, 64, 1]],

#     [-1, 1, GhostBottleneck, [256, 3, 2]], # 3-P3/8
#     [-1, 6, Bottleneck1CBAM_wfinception_CBAM, [128, 128, 2]],

#     [-1, 1, GhostBottleneck, [512, 3, 2]], # 5-P4/16
#     [-1, 9, Bottleneck1CBAM_wfinception_CBAM, [256, 256, 3]],

#     [-1, 1, GhostBottleneck, [1024, 3, 2]], # 7-P5/32
#     [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [512, 512, 1]],
#     # [-1, 3, SE_Block, [512,3]], # danh dau ==
#     # [-1, 3, CBAM, [512,512,3]], # danh dau ==
#     [-1, 1, SPPF, [1024, 5]], # 9
#   ]

# # YOLOv5 v6.0 head
# head: [
#     [-1, 1, Conv, [512, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#     [[-1, 6], 1, Concat, [1]], # cat backbone P4
#     [-1, 3, C3, [512, 512]], # 13

#     [-1, 1, Conv, [256, 1, 1]],
#     [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#     [[-1, 4], 1, Concat, [1]], # cat backbone P3
#     [-1, 3, C3, [256, 256]], # 17 (P5/32-large)
#     [-1, 3, CBAM, [128, 128,3]], # 18

#     [-1, 1, Conv, [256, 3, 2]], # 19
#     [[-1, 14], 1, Concat, [1]], # cat head P4
#     [-1, 3, C3, [256, 256]], # 21 (P5/32-large)
#     [-1, 3, CBAM, [128, 128,3]], # 22

#     [-1, 1, Conv, [512, 3, 2]], #23
#     [[-1, 10], 1, Concat, [1]], # cat head P5
#     [-1, 3, C3, [512, 512]], # 25 (P5/32-large)
#     [-1, 3, CBAM, [256, 256,3]], # 26

#     [[18, 22, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) de y them
#   ]

# Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [01:31<00:00,  3.27s/it]
#                    all        874        920      0.845      0.794       0.84      0.517
# Results saved to runs/train/exp6
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/38b9138f5ee345d7b1c9e4b4598bc0a4
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.47425103187561035, 2.203545570373535)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0013707215665094267, 0.8431872188564598)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.00040618101934608065, 0.5161445890374535)
# COMET INFO:     metrics/precision [200]    : (0.0009916094584286805, 0.8579159362143893)
# COMET INFO:     metrics/recall [200]       : (0.10978260869565218, 0.8)
# COMET INFO:     train/box_loss [200]       : (0.032033905386924744, 0.09925948083400726)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007065381854772568, 0.018823744729161263)
# COMET INFO:     val/box_loss [200]         : (0.039167556911706924, 0.09826882183551788)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004307529889047146, 0.009432673454284668)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:


# 100 epochs completed in 2.551 hours.
# Optimizer stripped from runs/train/exp8/weights/last.pt, 16.7MB
# Optimizer stripped from runs/train/exp8/weights/best.pt, 16.7MB

# Validating runs/train/exp8/weights/best.pt...
# Fusing layers... 
# thu summary: 481 layers, 8051206 parameters, 0 gradients, 22.5 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:09<00:00,  3.02it/s]
#                    all        874        920      0.853      0.798      0.848      0.512
# Results saved to runs/train/exp8
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/3583dfa086b949049a76e7d1a7ee4706
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.47225555777549744, 2.203545570373535)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0012655200417781634, 0.8480057704803748)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0003733451531547056, 0.5124828998131228)
# COMET INFO:     metrics/precision [200]    : (0.0009916094584286805, 0.8687515796427979)
# COMET INFO:     metrics/recall [200]       : (0.1565217391304348, 0.816304347826087)
# COMET INFO:     train/box_loss [200]       : (0.03210045397281647, 0.0992928221821785)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.0070831929333508015, 0.018825046718120575)
# COMET INFO:     val/box_loss [200]         : (0.03967086598277092, 0.09798306226730347)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004301731009036303, 0.009581021033227444)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:
# COMET INFO:     Name                        : exp
# COMET INFO:     Run Path                    : long0307/yolov5/3583dfa086b949049a76e7d1a7ee4706
# COMET INFO:     comet_log_batch_metrics     : False
# COMET INFO:     comet_log_confusion_matrix  : True
# COMET INFO:     comet_log_per_class_metrics : False
# COMET INFO:     comet_max_image_uploads     : 100
# COMET INFO:     comet_mode                  : online
# COMET INFO:     comet_model_name            : yolov5
# COMET INFO:     hasNestedParams             : True
# COMET INFO:   Parameters: