nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 3, 2]], # 0-P1/2
    # [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, GhostConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, CABottleneck, [64, 64]],

    [-1, 1, GhostConv, [256, 3, 2]], # 3-P3/8
    [-1, 6, CABottleneck, [128, 128]],

    [-1, 1, GhostConv, [512, 3, 2]], # 5-P4/16
    [-1, 9, CABottleneck, [256, 256]],

    [-1, 1, GhostConv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, CABottleneck, [512,512]],
    # [-1, 3, SE_Block, [512,3]], # danh dau ==
    # [-1, 3, CBAM, [512,512,3]], # danh dau ==
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3Ghost, [512, 512]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3Ghost, [256, 256]], # 17 (P5/32-large)
    # [-1, 3, CBAM, [128, 128,3]], # 18

    [-1, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3Ghost, [256, 256]], # 21 (P5/32-large)
    # [-1, 3, CBAM, [128, 128,3]], # 22

    [-1, 1, Conv, [512, 3, 2]], #23
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3Ghost, [512, 512]], # 25 (P5/32-large)
    # [-1, 3, CBAM, [256, 256,3]], # 26

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) de y them
  ]

# 100 epochs completed in 1.237 hours.
# Optimizer stripped from runs/train/exp206/weights/last.pt, 11.7MB
# Optimizer stripped from runs/train/exp206/weights/best.pt, 11.7MB

# Validating runs/train/exp206/weights/best.pt...
# Fusing layers... 
# newghost summary: 280 layers, 5630639 parameters, 0 gradients, 14.4 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:06<00:00,  4.57it/s]
#                    all        874        920       0.84      0.791      0.833      0.512
# Results saved to runs/train/exp206
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/a190e5875533494eae13c1e4eb2a362c
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4669452905654907, 2.1990814208984375)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.007066200014742653, 0.8364637104119248)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0016000036433777482, 0.5126615084587675)
# COMET INFO:     metrics/precision [200]    : (0.0012852784134248665, 0.8792775904739095)
# COMET INFO:     metrics/recall [200]       : (0.09565217391304348, 0.7943280236758498)
# COMET INFO:     train/box_loss [200]       : (0.03281480446457863, 0.09865545481443405)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007136444095522165, 0.019070791080594063)
# COMET INFO:     val/box_loss [200]         : (0.03958406299352646, 0.09171046316623688)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.00433996319770813, 0.009531254880130291)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others: