nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 3, 2]], # 0-P1/2
    # [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [64, 64, 1]],

    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, Bottleneck1CBAM_wfinception_CBAM, [128, 128, 2]],

    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, Bottleneck1CBAM_wfinception_CBAM, [256, 256, 3]],

    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, Bottleneck1CBAM_wfinception_CBAM, [512, 512, 1]],
    # [-1, 3, SE_Block, [512,3]], # danh dau ==
    # [-1, 3, CBAM, [512,512,3]], # danh dau ==
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, 512]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, 256]], # 17 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 18

    [-1, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [256, 256]], # 21 (P5/32-large)
    [-1, 3, CBAM, [128, 128,3]], # 22

    [-1, 1, Conv, [512, 3, 2]], #23
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [512, 512]], # 25 (P5/32-large)
    [-1, 3, CBAM, [256, 256,3]], # 26

    [[18, 22, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) de y them
  ]

  # python3 models/yolo.py --cfg yolov5con8.yaml
# YOLOv5con8 summary: 336 layers, 6099375 parameters, 0 gradients, 15.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:06<00:00,  4.39it/s]
#                    all        874        920      0.863      0.776      0.836      0.506
# Results saved to runs/train/exp100
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/6f56a826bd1c4e09a6c7d1d5129c893d
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4720120429992676, 2.1610636711120605)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.002363064932231476, 0.8406641786577882)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0006292418841772508, 0.5063210014403737)
# COMET INFO:     metrics/precision [200]    : (0.0012204424103737605, 0.8643215124317825)
# COMET INFO:     metrics/recall [200]       : (0.02717391304347826, 0.8097173260216739)
# COMET INFO:     train/box_loss [200]       : (0.032907966524362564, 0.09860529750585556)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007154554594308138, 0.018908632919192314)
# COMET INFO:     val/box_loss [200]         : (0.03962145373225212, 0.09245044738054276)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004327003378421068, 0.009695162065327168)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# C3
# 100 epochs completed in 1.230 hours.
# Optimizer stripped from runs/train/exp109/weights/last.pt, 13.4MB
# Optimizer stripped from runs/train/exp109/weights/best.pt, 13.4MB

# Validating runs/train/exp109/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 292 layers, 6481487 parameters, 0 gradients, 17.1 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:06<00:00,  4.35it/s]
#                    all        874        920      0.858      0.772      0.833      0.501
# Results saved to runs/train/exp109
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/98293675556840c68842b5b3a80ff1f0
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4790703058242798, 2.168254852294922)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0020703040964393784, 0.8383405866796767)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0006882040716132371, 0.5016159686980654)
# COMET INFO:     metrics/precision [200]    : (0.0013119755911517926, 0.8667252733837456)
# COMET INFO:     metrics/recall [200]       : (0.03260869565217391, 0.8206521739130435)
# COMET INFO:     train/box_loss [200]       : (0.03293466940522194, 0.09852757304906845)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.0072087389416992664, 0.018966566771268845)
# COMET INFO:     val/box_loss [200]         : (0.039602965116500854, 0.09236987680196762)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004364200867712498, 0.009362840093672276)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

# 100 epochs completed in 1.562 hours.
# Optimizer stripped from runs/train/exp115/weights/last.pt, 17.6MB
# Optimizer stripped from runs/train/exp115/weights/best.pt, 17.6MB

# Validating runs/train/exp115/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 383 layers, 8512536 parameters, 0 gradients, 22.9 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.90it/s]
#                    all        874        920      0.862      0.782      0.844      0.521
# Results saved to runs/train/exp115
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/f83ba412bcd9485a9ece66cd1eb67d62
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4528840184211731, 2.1858973503112793)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.001179129369771617, 0.8466053545443906)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0003923278044905904, 0.5214220202478237)
# COMET INFO:     metrics/precision [200]    : (0.0012051868802440886, 0.867052381309125)
# COMET INFO:     metrics/recall [200]       : (0.14891304347826087, 0.8054347826086956)
# COMET INFO:     train/box_loss [200]       : (0.031527239829301834, 0.0990593433380127)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006861455738544464, 0.019406674429774284)
# COMET INFO:     val/box_loss [200]         : (0.03875088319182396, 0.09237014502286911)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004242279566824436, 0.009654008783400059)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:


# 100 epochs completed in 1.569 hours.
# Optimizer stripped from runs/train/exp122/weights/last.pt, 17.6MB
# Optimizer stripped from runs/train/exp122/weights/best.pt, 17.6MB

# Validating runs/train/exp122/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 383 layers, 8512536 parameters, 0 gradients, 22.9 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.75it/s]
#                    all        874        920      0.847      0.816      0.846      0.511
# Results saved to runs/train/exp122
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/26c8c3b8962f4b5cb75656403a30018b
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4462411403656006, 2.1858973503112793)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.000787274848479726, 0.8495105598020938)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0003100437515623059, 0.5121547206104801)
# COMET INFO:     metrics/precision [200]    : (0.0011517925247902364, 0.8619853271602406)
# COMET INFO:     metrics/recall [200]       : (0.010869565217391304, 0.816304347826087)
# COMET INFO:     train/box_loss [200]       : (0.0316636860370636, 0.0993451252579689)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006856308784335852, 0.01937991939485073)
# COMET INFO:     val/box_loss [200]         : (0.03895258530974388, 0.09524721652269363)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004296347498893738, 0.009102041833102703)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:


# y = self.cv2(self.cv1(x))
# y = self.wf_inception_module(y)
# y = self.CBAM(y)
# y = self.SE_Block(y)

# 100 epochs completed in 1.623 hours.
# Optimizer stripped from runs/train/exp129/weights/last.pt, 17.6MB
# Optimizer stripped from runs/train/exp129/weights/best.pt, 17.6MB

# Validating runs/train/exp129/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 432 layers, 8515736 parameters, 0 gradients, 23.0 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.55it/s]
#                    all        874        920      0.832      0.795      0.839      0.519
# Results saved to runs/train/exp129
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/bb82db6d1a8a47a98c53a7cd3f6cdae9
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.42976999282836914, 2.2028560638427734)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0010219698212813896, 0.8503176626714417)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.00035389253635421453, 0.5187210530075326)
# COMET INFO:     metrics/precision [200]    : (0.0010983981693363845, 0.8675389557088427)
# COMET INFO:     metrics/recall [200]       : (0.19130434782608696, 0.8147259215737477)
# COMET INFO:     train/box_loss [200]       : (0.031440217047929764, 0.0989994928240776)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006863955408334732, 0.019045569002628326)
# COMET INFO:     val/box_loss [200]         : (0.03883930668234825, 0.09358756244182587)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004292958416044712, 0.009685699827969074)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:


# 100 epochs completed in 1.614 hours.
# Optimizer stripped from runs/train/exp133/weights/last.pt, 17.6MB
# Optimizer stripped from runs/train/exp133/weights/best.pt, 17.6MB

# Validating runs/train/exp133/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 432 layers, 8515736 parameters, 0 gradients, 23.0 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:09<00:00,  2.99it/s]
#                    all        874        920      0.832      0.806      0.848      0.523
# Results saved to runs/train/exp133
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/569e41ef7f74490ba8f0592dff06d450
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4490535855293274, 2.2028560638427734)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.001481570155028224, 0.8534087010959409)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0005189876259406933, 0.5225791740865575)
# COMET INFO:     metrics/precision [200]    : (0.0011022120518688024, 0.8574187185893876)
# COMET INFO:     metrics/recall [200]       : (0.17173913043478262, 0.8127132072784247)
# COMET INFO:     train/box_loss [200]       : (0.031797535717487335, 0.09880213439464569)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.006873673293739557, 0.019056269899010658)
# COMET INFO:     val/box_loss [200]         : (0.039100755006074905, 0.09390324354171753)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004286202136427164, 0.010067890398204327)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:

      # y = self.cv2(self.cv1(x))
      # y = self.wf_inception_module(y)
      # y = self.CBAM(y)
      # y = self.SE_Block(y)

# 100 epochs completed in 1.609 hours.
# Optimizer stripped from runs/train/exp139/weights/last.pt, 17.6MB
# Optimizer stripped from runs/train/exp139/weights/best.pt, 17.6MB

# Validating runs/train/exp139/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 467 layers, 9756376 parameters, 0 gradients, 23.2 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.75it/s]
#                    all        874        920      0.858      0.797      0.857      0.528
# Results saved to runs/train/exp139
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/a5c48f02b9b04bbaaf3724fce299de77
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.46127936244010925, 2.2028560638427734)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.001171579754805551, 0.8571731379649619)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0003451997196784639, 0.5280494978591547)
# COMET INFO:     metrics/precision [200]    : (0.0011670480549199084, 0.8584225797851849)
# COMET INFO:     metrics/recall [200]       : (0.11025890020455237, 0.8130434782608695)
# COMET INFO:     train/box_loss [200]       : (0.031650058925151825, 0.09893344342708588)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.0068765729665756226, 0.019060533493757248)
# COMET INFO:     val/box_loss [200]         : (0.039140310138463974, 0.09251061826944351)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004292779602110386, 0.009362192824482918)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others:



# 100 epochs completed in 1.626 hours.
# Optimizer stripped from runs/train/exp154/weights/last.pt, 21.6MB
# Optimizer stripped from runs/train/exp154/weights/best.pt, 21.6MB

# Validating runs/train/exp154/weights/best.pt...
# Fusing layers... 
# YOLOv5con8 summary: 455 layers, 10527736 parameters, 0 gradients, 24.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.72it/s]
#                    all        874        920      0.849      0.792      0.841      0.517
# Results saved to runs/train/exp154
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/8b800458b8494c13a323bd770c16a596
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.4561997652053833, 2.2412285804748535)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.008938674996620037, 0.8458665033066778)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0023765714840053545, 0.5167733467149469)
# COMET INFO:     metrics/precision [200]    : (0.0010259344012204423, 0.8640650889194578)
# COMET INFO:     metrics/recall [200]       : (0.11521739130434783, 0.8008744251497875)
# COMET INFO:     train/box_loss [200]       : (0.03151650354266167, 0.09876884520053864)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.00691455090418458, 0.019354842603206635)
# COMET INFO:     val/box_loss [200]         : (0.039304219186306, 0.09666429460048676)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004296969156712294, 0.00930738914757967)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others: