# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters

nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]

# 100 epochs completed in 1.063 hours.
# Optimizer stripped from runs/train/exp13/weights/last.pt, 14.4MB
# Optimizer stripped from runs/train/exp13/weights/best.pt, 14.4MB

# Validating runs/train/exp13/weights/best.pt...
# Fusing layers... 
# YOLOv5s summary: 157 layers, 7012822 parameters, 0 gradients, 15.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 5/5 [00:01<00:00,  3.75it/s]
#                    all        150        256      0.616      0.432      0.478      0.212  


# 200 epochs completed in 2.568 hours.
# Optimizer stripped from runs/train/exp68/weights/last.pt, 14.4MB
# Optimizer stripped from runs/train/exp68/weights/best.pt, 14.4MB

# Validating runs/train/exp68/weights/best.pt...
# Fusing layers... 
# YOLOv5_goc summary: 157 layers, 7012822 parameters, 0 gradients, 15.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 5/5 [00:02<00:00,  1.87it/s]
#                    all        150        256      0.663      0.566      0.513      0.224
# Results saved to runs/train/exp68
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/71c731ce50484a8cbe677b342b207d96
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [4420]                : (0.1672406792640686, 2.3963675498962402)
# COMET INFO:     metrics/mAP_0.5 [400]      : (0.0019445732350242826, 0.5125660226052291)
# COMET INFO:     metrics/mAP_0.5:0.95 [400] : (0.00042141581969991896, 0.22433533136318004)
# COMET INFO:     metrics/precision [400]    : (0.0017555555555555556, 0.6654356932309194)
# COMET INFO:     metrics/recall [400]       : (0.17241236772486776, 0.58203125)
# COMET INFO:     train/box_loss [400]       : (0.02560046873986721, 0.10288776457309723)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [400]       : (0.015315454453229904, 0.0351703055202961)
# COMET INFO:     val/box_loss [400]         : (0.053384918719530106, 0.09135942161083221)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [400]         : (0.016458893194794655, 0.02518024481832981)
# COMET INFO:     x/lr0 [400]                : (0.0001990000000000001, 0.07013574660633484)
# COMET INFO:     x/lr1 [400]                : (0.0001990000000000001, 0.00988606636500754)
# COMET INFO:     x/lr2 [400]                : (0.0001990000000000001, 0.00988606636500754)
# COMET INFO:   Others:
# COMET INFO:     Name                        : exp
# COMET INFO:     Run Path                    : long0307/yolov5/71c731ce50484a8cbe677b342b207d96
# COMET INFO:     comet_log_batch_metrics     : False
# COMET INFO:     comet_log_confusion_matrix  : True
# COMET INFO:     comet_log_per_class_metrics : False
# COMET INFO:     comet_max_image_uploads     : 100
# COMET INFO:     comet_mode                  : online
# COMET INFO:     comet_model_name            : yolov5
# COMET INFO:     hasNestedParams             : True
# COMET INFO:   Parameters:

# Hoangdataset

# 100 epochs completed in 1.136 hours.
# Optimizer stripped from runs/train/exp33/weights/last.pt, 14.4MB
# Optimizer stripped from runs/train/exp33/weights/best.pt, 14.4MB

# Validating runs/train/exp33/weights/best.pt...
# Fusing layers... 
# YOLOv5_goc summary: 157 layers, 7012822 parameters, 0 gradients, 15.8 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:06<00:00,  4.41it/s]
#                    all        874        920      0.849      0.796      0.841      0.499
# Results saved to runs/train/exp33
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/4a763ae126c34aaab28ad96b36238a98
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.49276939034461975, 2.202022075653076)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0004957889440610707, 0.8408859970522425)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.0001592366467208268, 0.4987574230240074)
# COMET INFO:     metrics/precision [200]    : (0.0007170099160945843, 0.8557077344083788)
# COMET INFO:     metrics/recall [200]       : (0.15543478260869564, 0.8076086956521739)
# COMET INFO:     train/box_loss [200]       : (0.033101920038461685, 0.10138171911239624)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007437495049089193, 0.020305370911955833)
# COMET INFO:     val/box_loss [200]         : (0.03855659440159798, 0.11730164289474487)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.004382416605949402, 0.01337126363068819)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others: