# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, GhostConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3Ghost, [128]],
    [-1, 1, GhostConv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3Ghost, [256]],
    [-1, 1, GhostConv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3Ghost, [512]],
    [-1, 1, GhostConv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3Ghost, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, GhostConv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3Ghost, [512, False]], # 13

    [-1, 1, GhostConv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3Ghost, [256, False]], # 17 (P3/8-small)

    [-1, 1, GhostConv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3Ghost, [512, False]], # 20 (P4/16-medium)

    [-1, 1, GhostConv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3Ghost, [1024, False]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]

#   100 epochs completed in 1.106 hours.
# Optimizer stripped from runs/train/exp14/weights/last.pt, 7.8MB
# Optimizer stripped from runs/train/exp14/weights/best.pt, 7.8MB

# Validating runs/train/exp14/weights/best.pt...
# Fusing layers... 
# YOLOv5s_ghost summary: 302 layers, 3675726 parameters, 0 gradients, 8.0 GFLOPs
#                  Class     Images  Instances          P          R      mAP50   mAP50-95: 100%|██████████| 28/28 [00:07<00:00,  3.55it/s]
#                    all        874        920      0.864      0.765       0.82      0.492
# Results saved to runs/train/exp14
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO: Comet.ml Experiment Summary
# COMET INFO: ---------------------------------------------------------------------------------------
# COMET INFO:   Data:
# COMET INFO:     display_summary_level : 1
# COMET INFO:     name                  : exp
# COMET INFO:     url                   : https://www.comet.com/long0307/yolov5/85a5e74ee5c241228ed66c5d316bb79b
# COMET INFO:   Metrics [count] (min, max):
# COMET INFO:     loss [2170]                : (0.49323770403862, 2.2071242332458496)
# COMET INFO:     metrics/mAP_0.5 [200]      : (0.0004536534351813118, 0.8223955557956955)
# COMET INFO:     metrics/mAP_0.5:0.95 [200] : (0.00011362446353362974, 0.49153091120334863)
# COMET INFO:     metrics/precision [200]    : (0.0007131960335621663, 0.8826959100770208)
# COMET INFO:     metrics/recall [200]       : (0.12608695652173912, 0.7702599338468904)
# COMET INFO:     train/box_loss [200]       : (0.03537069633603096, 0.10281632095575333)
# COMET INFO:     train/cls_loss             : 0.0
# COMET INFO:     train/obj_loss [200]       : (0.007793073542416096, 0.021956130862236023)
# COMET INFO:     val/box_loss [200]         : (0.040556274354457855, 0.1075141504406929)
# COMET INFO:     val/cls_loss               : 0.0
# COMET INFO:     val/obj_loss [200]         : (0.00440721632912755, 0.010927294380962849)
# COMET INFO:     x/lr0 [200]                : (0.0002980000000000002, 0.07013761467889909)
# COMET INFO:     x/lr1 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:     x/lr2 [200]                : (0.0002980000000000002, 0.009787012232415902)
# COMET INFO:   Others: